req_samples/IAMSAPReceiptTransferExport_V1/1-WSReceiptTransferRequest.req.in.TRF.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soap:Body>
		<WSReceiptTransferRequest xmlns="urn:Ariba:Buyer:vsap" variant="var1iam" partition="par1iam">
			<Receipt_ReceiptTransferHeaderDetails_Item>
				<item>
					<ERPPONumber>1002078995</ERPPONumber>
					<Password>ENCR(312531493234280318631613211321732473227321431973252)</Password>
					<IAMSAPUniqueName>TR-RC329434</IAMSAPUniqueName>
					<CreateDateString>20221119</CreateDateString>
					<IAMOrderMethodCategory>ZARD</IAMOrderMethodCategory>
					<UniqueName>TR-RC329434</UniqueName>
					<Login>ARIBA_CPIC</Login>
					<ApprovedDateString>20221119</ApprovedDateString>
				</item>
			</Receipt_ReceiptTransferHeaderDetails_Item>
			<Receipt_ReceiptTransferLineDetails_Item>
				<item>
					<ReceiptItems>
						<item>
							<ERPPOLineNumber>00001</ERPPOLineNumber>
							<ERPPONumber>1002078995</ERPPONumber>
							<LineItem>
								<IAMFinalDelivery>true</IAMFinalDelivery>
								<ReceivingType>2</ReceivingType>
							</LineItem>
							<UnitOfMeasure>
								<UniqueName>ES</UniqueName>
							</UnitOfMeasure>
							<NumberRejected>0.00000</NumberRejected>
							<NumberInCollection>1</NumberInCollection>
							<IAMNumberAQualif>2.00000</IAMNumberAQualif>
							<NumberAccepted>2.00000</NumberAccepted>
							<ReceiptId>TR-RC329434</ReceiptId>
							<IAMSAPMaterialDocumentReference>
								<MaterialDocument>5001744605</MaterialDocument>
								<MaterialDocumentYear>2021</MaterialDocumentYear>
								<DocumentItemNumber>0001</DocumentItemNumber>
							</IAMSAPMaterialDocumentReference>
							<AmountAccepted>
								<Amount>16261.28000</Amount>
							</AmountAccepted>
						</item>
						<item>
							<ERPPOLineNumber>00002</ERPPOLineNumber>
							<ERPPONumber>1002078995</ERPPONumber>
							<LineItem>
								<IAMFinalDelivery>true</IAMFinalDelivery>
								<ReceivingType>2</ReceivingType>
							</LineItem>
							<UnitOfMeasure>
								<UniqueName>ES</UniqueName>
							</UnitOfMeasure>
							<NumberRejected>0.00000</NumberRejected>
							<NumberInCollection>2</NumberInCollection>
							<IAMNumberAQualif>24.00000</IAMNumberAQualif>
							<NumberAccepted>24.00000</NumberAccepted>
							<ReceiptId>TR-RC329434</ReceiptId>
							<IAMSAPMaterialDocumentReference>
								<MaterialDocument>5001744605</MaterialDocument>
								<MaterialDocumentYear>2021</MaterialDocumentYear>
								<DocumentItemNumber>0002</DocumentItemNumber>
							</IAMSAPMaterialDocumentReference>
							<AmountAccepted>
								<Amount>114926.88000</Amount>
							</AmountAccepted>
						</item>
					</ReceiptItems>
				</item>
			</Receipt_ReceiptTransferLineDetails_Item>
		</WSReceiptTransferRequest>
	</soap:Body>
</soap:Envelope>